Repository: lucascruzestudo/DOTNET_JamcoreAPI
Catalog: source/Application/Resources/SharedResources.*.resx
Languages: pt_br

# RequiredField
source: {0} is required.
pt_br: {0} é obrigatório.

# FieldNotFound
source: {0} could not be found.
pt_br: {0} não foi encontrado.

# InvalidEmail
source: {0} is invalid.
pt_br: {0} não é válido.

# MinLength
source: {0} must be at least {1} characters long.
pt_br: {0} deve ter ao menos {1} caracteres.

# MaxLength
source: {0} must be no longer than {1} characters.
pt_br: {0} deve ter no máximo {1} caracteres.

# PasswordMinLength
source: Password must be at least {0} characters long.
pt_br: A senha deve ter ao menos {0} caracteres.

# PasswordUppercase
source: Password must contain at least one uppercase letter.
pt_br: A senha deve conter ao menos uma letra maiúscula.

# PasswordLowercase
source: Password must contain at least one lowercase letter.
pt_br: A senha deve conter ao menos uma letra minúscula.

# PasswordNumber
source: Password must contain at least one number.
pt_br: A senha deve conter ao menos um número.

# PasswordSpecialCharacter
source: Password must contain at least one special character.
pt_br: A senha deve conter ao menos um caractere especial.

# LoginInvalidCredentials
source: Invalid username or password.
pt_br: Nome de usuário ou senha inválidos.

# Success
source: Your action was completed successfully.
pt_br: Sua ação foi concluída com sucesso.

# RegisterUsernameExists
source: Username already exists.
pt_br: O nome de usuário ja existe.

# RegisterEmailExists
source: Email already exists.
pt_br: O email já existe.

source: Invalid token.
pt_br: Token inválido.

source: Invalid user.
pt_br: Usuário inválido.

# InvalidUrl
source: Invalid URL {0}.
pt_br: Endereço web {0} inválido.

# ConfirmEmailSubject
source: Account Confirmation
pt_br: Confirmação de Conta

# ConfirmEmailBody
source: <![CDATA[<h1>You're almost done with your registration, @{0}!</h1> <p>Thank you for registering with us.</p> <p>Please click the link below to confirm your email address:</p> <a href='{1}'>Confirm Email</a> <br></br> <p>The confirmation link will expire in {2} minutes.</p> <p>If you did not register for this account, please ignore this email.</p>]]>
pt_br: <![CDATA[<h1>Você está prestes a concluir seu registro, @{0}!</h1> <p>Por favor, clique no link abaixo para confirmar seu endereço de e-mail:</p> <a href='{1}'>Confirmar e-mail</a> <br></br> <p>O link de confirmação expirará em {2} minutos.</p> <p>Se você não se registrou para esta conta, por favor ignore este e-mail.</p>]]>

# AccountConfirmedSubject
source: Account Confirmed
pt_br: Conta Confirmada

# AccountConfirmedBody
source: <![CDATA[<h1>Welcome @{0}!</h1> <p>Thank you for confirming your email address. Your account is now fully activated.</p> <p>You can now access your account and start using our platform.</p> <p>If you have any questions or need assistance, feel free to contact our support team.</p>]]>
pt_br: <![CDATA[<h1>Bem-vindo(a) {0}!</h1> <p>Obrigado por confirmar seu endereço de e-mail. Sua conta já está completamente ativada.</p> <p>Agora você pode acessar sua conta e começar a usar nossa plataforma.</p> <p>Se tiver alguma dúvida ou precisar de assistência, por favor, não hesite em entrar em contato com nossa equipe de suporte.</p>]]>
